app/controllers/api/v1/portfolio_controller.rb

SELECT "portfolios".* FROM "portfolios"
---
      def index
             begin
               if params[:user_id].present?
                    @portfolio = Portfolio.where("user_id = '#{params[:user_id]}'")
               else
                    @portfolio = Portfolio.all

SELECT "portfolios".* FROM "portfolios" WHERE (name = 'iphone app development243786786')
INSERT INTO "portfolios" ("name", "description", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "projectarea", "user_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
      def addproject
              # skip_before_action :authenticate
		      	  begin
	       	        portname = $FullSanitizer.sanitize(params[:name]).downcase
  		  	        #check the project name exists or name
                  @checkprojectexists = Portfolio.where("name = '#{portname}'")
                  if @checkprojectexists.present?
                   	 render :json => { success: false, message: "project name already exists" }, :status => 401
                  else
                 # Strong Parameters
     						    parameters = ActionController::Parameters.new(:name => portname,
						  	              :description => params[:desc],
						  	              :projectarea =>params[:area],
						  	              :avatar => params[:avatar],
						  	              :user_id => params[:userid],
						  	              :start_date=>params[:startdate],
		  			  	              :end_date=>params[:enddate])
					        permitted_parameters = parameters.permit(:name,:description,:avatar,:projectarea, :user_id,:start_date,:end_date)
                  @portfolio = Portfolio.new(permitted_parameters)
							      if @portfolio.save!

DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 8]]
---
      def deleteproject

              begin
                  @id = params[:id]

                  if @id.present?
                    @delete = Portfolio.destroy(@id)

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT 1  [["id", 0]]
SELECT  "portfolios".* FROM "portfolios" WHERE ('18') LIMIT 1
---
      def editproject
          begin
                  @id =  params[:id]
                  @portfolio = Portfolio.find_by_id('#{@id}')
                  if @portfolio.present?