app/controllers/api/v1/users_controller.rb

	def register

		   begin
		   	     # Sanitize POST data
						# username = params[:username]
						username = $FullSanitizer.sanitize(params[:username]).downcase
					  # Strong Parameters
					  parameters = ActionController::Parameters.new(:email => params[:email],
					  	              :password => params[:password],
					  	              :password_confirmation => params[:password_confirmation],
					  	              :firstname => params[:firstname],
					  	              :lastname =>params[:lastname])

					  permitted_parameters = parameters.permit(:email,:firstname,:lastname, :password, :password_confirmation)


					  # Create User
					  @user = User.new(permitted_parameters)
					  if @user.save!
---
INSERT INTO "users" ("email", "firstname", "lastname", "encrypted_password", "created_at", "updated_at", "authentication_token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

 def login

 	      begin
					  # ...
					  if params[:email].to_s =~ /^.+@.+$/
				      @user = User.find_by_email(params[:email])
				    else
				      @user = User.find_by_email(params[:email])
				    end



					  if @user && @user.valid_password?(params[:password])

					    	# Generate New Authentication token if login is success
					      @user.ensure_authentication_token!
					      # @user.timezone = $FullSanitizer.sanitize(params[:timezone])
					     	@user.save!
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "testnew@gmail.com"]]
UPDATE "users" SET "authentication_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["authentication_token", "Nva7kPw7bt_U44HEzSU-"], ["updated_at", "2016-06-21 06:58:37.723120"], ["id", 9]]